шифрование:
Шифр Атбаша — переворот алфавита с ног на голову.

Шифр Цезаря — смещение каждой буквы на ключевое число значений.

Шифр Вернама (XOR-шифр) — простейший шифр на основе бинарной логики, который обладает абсолютной криптографической стойкостью.

Шифр кодового слова — сдвиг алфавита на кодовое слово.

Шифр Плейфера — матрица 5х5, заполненная символами латинского алфавита, кодовое слово и дальнейшие манипуляции над ними.
    ----------------------------------------------------------------------------------------------------------------

	 шифр Атбаша:
def Atbash(tt):
    result = ""
    for i in tt:
        if i.isalpha():
            if i.isupper():
                result += chr(90 - ord(i) + 65)
            else:
                result += chr(122 - ord(i) + 97)
        else:
            result += i
    return result

tt = input()
cc = Atbash(tt)
print(cc)
-----------------------------------------------------------------------------------------------------------------------------
	шифр Цезаря:
		def cc(tt , ss):
    print("какой вы хотите использовать алфавит? русский/english")
    aa = input()
    if aa == 'русский':
        al = ['а', 'б', 'в', 'г', 'д', 'е', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф','х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']
    else:
        al = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
    ss = int(input())
    tt = input()
    kk = 0
    for i in tt:
        if tt.isalpha():
            if tt.islower():
                al = al.lower()
                ci = al.index(i)
                ni = (ci + ss) % 26
                kk += al[ni]
            else:
                kk += i
                en = cc(tt, ss)
                print(en)
                dd = cc(en, -ss)
                print(dd)
